In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
import pandas as pd
dados = pd.read_csv("/content/drive/My Drive/Base_de_dados_programacao_xl - Base_de_dok.csv")
dados

       Ano  MÃªs  ... Passageiros carga e correio (kg),
0     2019   1.0  ...      7169.0                126460
1     2019   1.0  ...    132819.0               3254526
2     2019   1.0  ...     25586.0                460667
3     2019   1.0  ...     25011.0                594884
4     2019   1.0  ...     64770.0               1676283
...    ...   ...  ...         ...                   ...
1655  2020  12.0  ...      7860.0               2525779
1656  2020  12.0  ...     20990.0               2301634
1657  2020  12.0  ...         0.0                 14168
1658  2020  12.0  ...         0.0               2031978
1659  2020  12.0  ...         0.0                 46871

[1660 rows x 8 columns]

In [ ]:
display(dados.dtypes)
display(dados.head())

Ano                       object
MÃªs                     float64
Empresa (nome)            object
Empresa (sigla)           object
Empresa (pais)            object
Natureza                  object
Passageiros              float64
carga e correio (kg),     object
dtype: object

    Ano  MÃªs  ... Passageiros carga e correio (kg),
0  2019   1.0  ...      7169.0                126460
1  2019   1.0  ...    132819.0               3254526
2  2019   1.0  ...     25586.0                460667
3  2019   1.0  ...     25011.0                594884
4  2019   1.0  ...     64770.0               1676283

[5 rows x 8 columns]

In [ ]:
dados.info()
print('_'*40)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1660 entries, 0 to 1659
Data columns (total 8 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Ano                    1660 non-null   object
 1   MÃªs                   1657 non-null   float64
 2   Empresa (nome)         1657 non-null   object
 3   Empresa (sigla)        1657 non-null   object
 4   Empresa (pais)         1657 non-null   object
 5   Natureza               1657 non-null   object
 6   Passageiros            1656 non-null   float64
 7   carga e correio (kg),  1657 non-null   object
dtypes: float64(2), object(6)
memory usage: 103.9+ KB
________________________________________

Na primeira sumarização foi feito um agrupamento dos dados da quantidade de passageiros transportados a cada mês.

In [ ]:
dados.groupby('MÃªs').sum()

      Passageiros
MÃªs
1.0    22874692.0
2.0    19022467.0
3.0    16025770.0
4.0     9652948.0
5.0     9627358.0
6.0     9846051.0
7.0    12462273.0
8.0    12252752.0
9.0    12923151.0
10.0   14550694.0
11.0   14930660.0
12.0   17003486.0

Nessa sumarização foi feito o agrupamento da Natureza, sendo separado em Internacional e Doméstico, sendo somado todos as vezes que essas variáveis aparecem.

In [ ]:
dados.groupby('Natureza').size()

Natureza
DOMÃ‰STICA        268
INTERNACIONAL    1389
dtype: int64

In [ ]:
len(dados[dados.Natureza=='INTERNACIONAL'])

1389

In [ ]:
len(dados[dados.Natureza=='DOMÃ‰STICA'])

268

In [ ]:
da = pd.Series({'INTERNACIONAL':1389,'DOMÃ‰STICA':268})
df = pd.DataFrame([da])
df

   INTERNACIONAL  DOMÃ‰STICA
0           1389         268

Nessa sumarização foi agrupado o Ano, sendo somado o de 2019 e 2020, sendo somado todos as vezes que essas variáveis aparecem.

In [ ]:
dados.groupby('Ano').size()

Ano
2019                                                                                   877
2019;4;"LÃNEAS AÃ‰REAS SURAMERICANAS ""LAS""";LAU;COLÃ”MBIA;INTERNACIONAL;0;46324,      1
2020                                                                                   780
2020;2;"LÃNEAS AÃ‰REAS SURAMERICANAS ""LAS""";LAU;COLÃ”MBIA;INTERNACIONAL;0;32802,      1
2020;3;"LÃNEAS AÃ‰REAS SURAMERICANAS ""LAS""";LAU;COLÃ”MBIA;INTERNACIONAL;0;43736,      1
dtype: int64

In [ ]:
da = pd.Series({'2019':878,'2020':782})
df = pd.DataFrame([da])
df

   2019  2020
0   878   782